ezois_ka/oooezoiskaobmen/src/Documents/ЗапросРеквизитовДляВыплатыПособия/ЗапросРеквизитовДляВыплатыПособия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросРеквизитовДляВыплатыПособия</name>
  <comment>Тип СЭДО: 32</comment>
  <attributes>
    <name>ВерсияСпецификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПособия</name>
    <type>
      <types>EnumRef.ПособияНазначаемыеФСС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящееЗаявление</name>
    <type>
      <types>DocumentRef.ЗаявлениеСотрудникаНаВыплатуПособия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийЗапрос</name>
    <type>
      <types>DocumentRef.ВходящийЗапросФССДляРасчетаПособия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийНомерРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийОтветНаЗапрос</name>
    <type>
      <types>DocumentRef.ОтветНаЗапросФССДляРасчетаПособия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийПервичныйДокумент</name>
    <type>
      <types>DefinedType.ДокументыОснованияЗаявленияСотрудникаНаВыплатуПособия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийРеестр</name>
    <type>
      <types>DefinedType.РеестрПрямыхВыплатСФР</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиПодтверждения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСообщения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Загружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения101</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаПособия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТОФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДатаОбработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТОФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НедостающиеСведенияКратко</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеобработанныеУзлы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПроцесса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиРеестра</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветНаЗапрос</name>
    <type>
      <types>DocumentRef.ОтветНаЗапросРеквизитовДляВыплатыПособия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйСФРДолжность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>800</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйСФРТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйСФРФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтпускПоУходуДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтпускПоУходуДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантСФРДолжность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантСФРФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждениеДоставлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ребенок</name>
    <type>
      <types>DefinedType.РодственникФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РебенокДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РебенокСНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерСФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникСНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникФамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПодтверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФиксацияИзменений</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Путь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НедостающиеСведения</name>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиФикс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Documents/ЗапросРеквизитовДляВыплатыПособия/Forms/ФормаДокумента/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ТребуетсяЗаполнитьИсходящиеДокументы = Ложь;
	ИсходящиеДокументы = Документы.ЗапросРеквизитовДляВыплатыПособия.ИсходящиеДокументы(ТекущийОбъект);
	
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = '%1 загружаются в автоматическом режиме'"),
			РеквизитФормыВЗначение("Объект").Метаданные().ПредставлениеСписка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ПравоИзменения
		И ПравоПолученияЭД
		И Объект.Загружен
		И Объект.ТребуетсяПодтверждение
		И Не Объект.Обработан
		И Не ЗначениеЗаполнено(Объект.ДатаОтправкиПодтверждения) Тогда
		КонтекстПодтвержденияПолучения = СЭДОФСС.КонтекстПодтвержденияПолучения(Объект.Ссылка);
	Иначе
		КонтекстПодтвержденияПолучения = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если КонтекстПодтвержденияПолучения <> Неопределено Тогда
		СЭДОФССКлиент.ПредложитьПодтвердитьПолучение(КонтекстПодтвержденияПолучения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ИмяСобытия = "Запись_БольничныйЛист"
		Или ИмяСобытия = "Запись_ВходящийЗапросФССДляРасчетаПособия"
		Или ИмяСобытия = "Запись_ОтветНаЗапросФССДляРасчетаПособия"
		Или ИмяСобытия = "Запись_ЗаявлениеСотрудникаНаВыплатуПособия"
		Или ИмяСобытия = "Запись_РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий"
		Или ИмяСобытия = "Запись_РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам"
		Или ИмяСобытия = СЭДОФССКлиент.ИмяСобытияПослеПолученияСообщенийОтФСС()
		Или ИмяСобытия = СЭДОФССКлиент.ИмяСобытияПослеОтправкиПодтвержденияПолучения() Тогда
		ТребуетсяЗаполнитьИсходящиеДокументы = Истина;
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_БольничныйЛист"
		Или ИмяСобытия = "Запись_ОтпускПоУходуЗаРебенком"
		Или ИмяСобытия = "Запись_Отпуск"
		Или ИмяСобытия = СЭДОФССКлиент.ИмяСобытияПослеПолученияСообщенийОтФСС()
		Или ИмяСобытия = СЭДОФССКлиент.ИмяСобытияПослеОтправкиПодтвержденияПолучения() Тогда
		Если Модифицированность Тогда
			ОбновитьВторичныеДанныеОбъектаИЭлементыФормы();
		Иначе
			Прочитать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ФиксацияЗаполнитьИдентификаторыФиксТЧ(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ФиксацияВторичныхДанныхВДокументахКлиентСервер.СохранитьРеквизитыФормыФикс(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ФиксацияЗаполнитьРеквизитыФормыФикс(ТекущийОбъект);
	ФиксацияВторичныхДанныхВДокументахФормы.УстановитьОбъектЗафиксирован(ЭтотОбъект);
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ЗапросНедостающихСведенийПособияСФР", ПараметрыЗаписи, Объект.Ссылка);
	СЭДОФССКлиент.ОповеститьОНеобходимостиОбновитьТекущиеДела();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	ФизическоеЛицоПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВходящийЗапросПриИзменении(Элемент)
	ВходящийЗапросПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВходящийОтветНаЗапросПриИзменении(Элемент)
	ВходящийОтветНаЗапросПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВходящийРеестрПриИзменении(Элемент)
	ВходящийРеестрПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВходящееЗаявлениеПриИзменении(Элемент)
	ВходящееЗаявлениеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВходящийПервичныйДокументПриИзменении(Элемент)
	ВходящийПервичныйДокументПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НадписьТребуетсяПодтверждениеОбработкаНавигационнойСсылки(Элемент, Адрес, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Объект.Ссылка);
	СЭДОФССКлиент.ОтправитьПодтверждениеПолучения(МассивСсылок);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыНедостающиеСведения

&НаКлиенте
Процедура НедостающиеСведенияПриИзменении(Элемент)
	ОбновитьВторичныеДанныеНаСервере();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Если Записать() Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	ВключитьВозможностьРедактированияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВторичныеДанные(Команда)
	ОбновитьВторичныеДанныеОбъектаИЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИсправления(Команда)
	ОтменитьВсеИсправленияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВопросВПоддержку(Команда)
	СЭДОФССКлиент.ОткрытьВопросВПоддержку(ПодготовитьВопросВПоддержку());
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область Форма

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ТекущийОбъект)
	Если Элементы.КодВидаПособия.СписокВыбора.Количество() = 0 Тогда
		СЭДОФСС.СписокВыбораКодовВидаПособия(Элементы.КодВидаПособия.СписокВыбора, Объект.КодВидаПособия);
	КонецЕсли;
	
	ФиксацияВторичныхДанныхВДокументахФормы.ИнициализироватьМеханизмФиксацииРеквизитов(ЭтотОбъект, ТекущийОбъект);
	ФиксацияВторичныхДанныхВДокументахФормы.ПодключитьОбработчикиФиксацииИзмененийРеквизитов(ЭтотОбъект, ФиксацияБыстрыйПоискРеквизитов());
	ОбновитьВторичныеДанныеОбъектаИЭлементыФормы();
	
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		ЗначенияПоУмолчанию = Новый Структура("Ответственный");
		ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗначенияПоУмолчанию);
		Объект.Ответственный = ЗначенияПоУмолчанию.Ответственный;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьВторичныеДанныеОбъектаИЭлементыФормы()
	ОбновитьВторичныеДанныеНаСервере();
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	ФиксацияВторичныхДанныхВДокументахКлиентСервер.ОбновитьФорму(ЭтотОбъект);
	ПравоИзменения   = (Элементы.Найти("ФормаПровести") <> Неопределено);
	ПравоПолученияЭД = СЭДОФСС.ЕстьПравоПолучения();
	РежимРедактирования = ?(ПравоИзменения, Элементы.ВключитьВозможностьРедактирования.Пометка, Ложь);
	
	СЭДОФСС.ОбновитьСвертываемыеГруппы(ЭтотОбъект);
	
	СЭДОФСС.НастроитьПолеВводаПервичногоДокумента(
		Объект.ВидПособия,
		Объект.Сотрудник,
		Элементы.ВходящийПервичныйДокумент,
		Объект.ВходящийПервичныйДокумент);
	
	ОбновитьКнопки();
	ОбновитьПодтверждениеПолучения();
	
	Элементы.ВходящийНомерДатаГруппа.Видимость = Объект.Загружен;
	Элементы.ОтветНаЗапросГруппа.Видимость = Объект.Загружен;
	Элементы.Страхователь.Видимость = ЕстьФилиалыНеСтрахователи Или (Объект.Организация <> Объект.Страхователь);
	Элементы.НеобработанныеУзлыГруппа.Видимость = ЗначениеЗаполнено(Объект.НеобработанныеУзлы);
	
	Элементы.СоздатьОтветНаЗапрос.Видимость = Не ЗначениеЗаполнено(Объект.ОтветНаЗапрос);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКнопки()
	
	ПравоИзмененияИПолученияЭД = ПравоИзменения И ПравоПолученияЭД;
	
	Кнопка = Элементы.Найти("ФормаПровестиИЗакрыть");
	Если Кнопка <> Неопределено Тогда
		Кнопка.КнопкаПоУмолчанию = Объект.Загружен И Модифицированность;
	КонецЕсли;
	
	Кнопка = Элементы.Найти("ФормаПодтвердитьПолучение");
	Если Кнопка <> Неопределено Тогда
		Кнопка.Видимость = ПравоИзмененияИПолученияЭД;
		Кнопка.ТолькоВоВсехДействиях = Не Объект.Загружен Или Не Объект.ТребуетсяПодтверждение
			Или ЗначениеЗаполнено(Объект.ДатаОтправкиПодтверждения);
	КонецЕсли;
	
	Если Не ПравоИзмененияИПолученияЭД Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПолучитьИзСЭДО", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПовторноПолучитьИзСЭДО", "Видимость", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодтверждениеПолучения()
	Если Не Объект.Загружен Тогда
		ТекущаяСтраница = Элементы.СтраницаТребуетсяПолучить;
	ИначеЕсли Не Объект.ТребуетсяПодтверждение Тогда
		ТекущаяСтраница = Элементы.СтраницаПодтверждениеНеТребуется;
	ИначеЕсли ЗначениеЗаполнено(Объект.ДатаОтправкиПодтверждения) Тогда
		Если Объект.ПодтверждениеДоставлено Тогда
			ТекущаяСтраница = Элементы.СтраницаПодтверждениеДоставлено;
			Элементы.НадписьПодтверждениеОтправленоИПолучено.Заголовок = СтрШаблон(
				НСтр("ru = 'Подтверждение получения отправлено %1 и доставлено СФР.'"),
				Формат(Объект.ДатаОтправкиПодтверждения, "ДЛФ=D"));
			НадписьОсталосьДней = Элементы.НадписьОсталосьДней2;
		Иначе
			ТекущаяСтраница = Элементы.СтраницаПодтверждениеОтправлено;
			Элементы.НадписьПодтверждениеОтправленоНоНеПолучено.Заголовок = СтрШаблон(
				НСтр("ru = 'Подтверждение получения отправлено %1.'"),
				Формат(Объект.ДатаОтправкиПодтверждения, "ДЛФ=D"));
			НадписьОсталосьДней = Элементы.НадписьОсталосьДней1;
		КонецЕсли;
		Если Объект.Обработан Тогда
			НадписьОсталосьДней.Заголовок  = "";
			НадписьОсталосьДней.ЦветТекста = Новый Цвет;
		Иначе
			ОсталосьДней = ОбщегоНазначенияБЗК.КоличествоДнейДоДаты(Объект.МаксимальнаяДатаОбработки);
			Если ОсталосьДней <= 1 Тогда
				НадписьОсталосьДней.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
					НСтр("ru = 'Необходимо <b>сегодня</b> отправить сведения в СФР'"));
				НадписьОсталосьДней.ЦветТекста = ЦветаСтиля.ПоясняющийОшибкуТекст;
			Иначе
				НадписьОсталосьДней.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
					СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
						НСтр("ru = ';Остался <b>%1 день</b> для отправки сведений в СФР;;Осталось <b>%1 дня</b> для отправки сведений в СФР;Осталось %1 дней для отправки сведений в СФР;'"),
						ОсталосьДней));
				НадписьОсталосьДней.ЦветТекста = Новый Цвет;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Объект.МаксимальнаяДатаПодтверждения) И Не Объект.Обработан Тогда
		ТекущаяСтраница = Элементы.СтраницаТребуетсяПодтверждение;
		ОсталосьДней = ОбщегоНазначенияБЗК.КоличествоДнейДоДаты(Объект.МаксимальнаяДатаПодтверждения);
		Если ОсталосьДней <= 1 Тогда
			Когда = НСтр("ru = '<b>сегодня</b>'");
			ЦветТекста = ЦветаСтиля.ПоясняющийОшибкуТекст;
		Иначе
			Когда = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
				НСтр("ru = ';в течение %1 дня;;в течение %1 дней;в течение %1 дней;'"),
				ОсталосьДней);
			ЦветТекста = Новый Цвет;
		КонецЕсли;
		ЗаголовокНадписи = СтрШаблон(
			НСтр("ru = 'Необходимо %1 <a href=""1"">подтвердить получение</a> документа, после чего отправить сведения в течении <b>%2 рабочих дней</b>.'"),
			Когда,
			Документы.ЗапросРеквизитовДляВыплатыПособия.РабочихДнейНаОтвет());
		Элементы.НадписьТребуетсяПодтверждение.Заголовок  = СтроковыеФункции.ФорматированнаяСтрока(ЗаголовокНадписи);
		Элементы.НадписьТребуетсяПодтверждение.ЦветТекста = ЦветТекста;
	Иначе
		ТекущаяСтраница = Элементы.СтраницаПодтверждениеНеТребуется;
	КонецЕсли;
	СЭДОФССКлиентСервер.УстановитьСтраницу(Элементы.СтраницыПодтвержденияПолучения, ТекущаяСтраница);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьПредставление(Представление, РазделительДо, Строка)
	Представление = ?(Представление = "", Строка, Представление + РазделительДо + Строка);
КонецПроцедуры

#КонецОбласти

#Область СвертываемыеГруппы

&НаСервере
Процедура ПриОпределенииСвертываемыхГрупп(Группы) Экспорт
	Группы.Добавить(Элементы.СотрудникГруппа);
	Группы.Добавить(Элементы.ПособиеГруппа);
	Группы.Добавить(Элементы.НедостающиеСведенияГруппа);
	Группы.Добавить(Элементы.РанееОтправленныеСведенияГруппа);
	Группы.Добавить(Элементы.ТОФГруппа);
КонецПроцедуры

&НаСервере
Процедура ПослеДобавленияЭлементовСвертываемыхГрупп() Экспорт
	// Обработка не требуется.
КонецПроцедуры

&НаСервере
Процедура ПриОпределенииСвойствСвертываемойГруппы(Группа, Представление, Заполнена, Развернута, Видимость) Экспорт
	
	Если Группа = Элементы.СотрудникГруппа Тогда
		ОбновитьЭлементыГруппыСотрудник(Группа, Представление, Заполнена, Развернута, Видимость);
		
	ИначеЕсли Группа = Элементы.ПособиеГруппа Тогда
		ОбновитьЭлементыГруппыПособие(Группа, Представление, Заполнена, Развернута, Видимость);
		
	ИначеЕсли Группа = Элементы.НедостающиеСведенияГруппа Тогда
		ОбновитьЭлементыГруппыНедостающиеСведения(Группа, Представление, Заполнена, Развернута, Видимость);
		
	ИначеЕсли Группа = Элементы.РанееОтправленныеСведенияГруппа Тогда
		ОбновитьЭлементыГруппыРанееОтправленныеСведения(Группа, Представление, Заполнена, Развернута, Видимость);
		
	ИначеЕсли Группа = Элементы.ТОФГруппа Тогда
		ОбновитьЭлементыГруппыТОФ(Группа, Представление, Заполнена, Развернута, Видимость);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвернутьРазвернутьГруппу(Элемент)
	СвернутьРазвернутьГруппу(Элемент.Имя);
КонецПроцедуры

&НаСервере
Процедура СвернутьРазвернутьГруппу(ИмяЭлемента)
	СЭДОФСС.СвернутьРазвернутьГруппу(ЭтотОбъект, ИмяЭлемента);
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаСервере
Процедура ВключитьВозможностьРедактированияНаСервере()
	РежимРедактирования = Истина;
	Элементы.ВключитьВозможностьРедактирования.Пометка = Истина;
	Элементы.ВключитьВозможностьРедактирования.Доступность = Ложь;
	Для Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПолеФормы")
			И Элемент.ТолькоПросмотр Тогда
			Элемент.ТолькоПросмотр = Ложь;
		ИначеЕсли ТипЗнч(Элемент) = Тип("ГруппаФормы")
			И Элемент.ТолькоПросмотр Тогда
			Элемент.ТолькоПросмотр = Ложь;
		ИначеЕсли ТипЗнч(Элемент) = Тип("ТаблицаФормы")
			И (Элемент.ТолькоПросмотр Или Не Элемент.ИзменятьСоставСтрок) Тогда
			Элемент.ТолькоПросмотр = Ложь;
			Элемент.ИзменятьПорядокСтрок = Истина;
			Элемент.ИзменятьСоставСтрок = Истина;
			Элемент.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Авто;
			Элемент.РастягиватьПоВертикали = Истина;
			Элемент.Шапка = Истина;
		КонецЕсли;
	КонецЦикла;
	ОбновитьЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область Организация

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	ЗафиксироватьИзменениеРеквизита("Организация");
	ОбновитьВторичныеДанныеОбъектаИЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область Сотрудник

&НаСервере
Процедура ОбновитьЭлементыГруппыСотрудник(Группа, Представление, Заполнена, Развернута, Видимость)
	Видимость = Объект.Загружен;
	Если Не Видимость Тогда
		Возврат;
	КонецЕсли;
	Заполнена = ЗначениеЗаполнено(Объект.Сотрудник) И ЗначениеЗаполнено(Объект.ФизическоеЛицо);
	Если Развернута Тогда
		Элементы.СотрудникСНИЛС.Видимость = РежимРедактирования Или ЗначениеЗаполнено(Объект.СотрудникСНИЛС);
		Элементы.ГруппаСотрудникФИО.Видимость = РежимРедактирования Или ЗначениеЗаполнено(Объект.СотрудникФамилия);
	Иначе
		Представления = Новый Массив;
		Если Заполнена Тогда
			Представление = Строка(Объект.Сотрудник);
		ИначеЕсли ЗначениеЗаполнено(Объект.ФизическоеЛицо) Тогда
			Представление = СтрШаблон(НСтр("ru = '<%1 не найден в организации %2>'"),
				Строка(Объект.ФизическоеЛицо),
				Строка(Объект.Страхователь));
		ИначеЕсли ЗначениеЗаполнено(Объект.СотрудникСНИЛС) Тогда
			Представление = СтрШаблон(НСтр("ru = '<Не найден сотрудник со СНИЛС %1 и ФИО %2>'"),
				Объект.СотрудникСНИЛС,
				СокрЛП(Объект.СотрудникФамилия + " " + Объект.СотрудникИмя + " " + Объект.СотрудникОтчество));
		ИначеЕсли ЗначениеЗаполнено(Объект.СотрудникФамилия) Тогда
			Представление = СтрШаблон(НСтр("ru = '<Не найден сотрудник по ФИО %1>'"),
				СокрЛП(Объект.СотрудникФамилия + " " + Объект.СотрудникИмя + " " + Объект.СотрудникОтчество));
		Иначе
			Представление = НСтр("ru = '<В сообщении не указаны ФИО и СНИЛС>'");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	ЗафиксироватьИзменениеРеквизита("ФизическоеЛицо");
	ЗафиксироватьИзменениеРеквизита("Сотрудник");
	ФиксацияВторичныхДанныхВДокументах.ЗаполнитьФизическоеЛицо(Объект);
	ОбновитьВторичныеДанныеОбъектаИЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура ФизическоеЛицоПриИзмененииНаСервере()
	ЗафиксироватьИзменениеРеквизита("ФизическоеЛицо");
	ЗафиксироватьИзменениеРеквизита("Сотрудник");
	Объект.Сотрудник = КадровыйУчет.ОсновнойСотрудникФизическогоЛица(
		Объект.ФизическоеЛицо,
		Объект.Организация,
		НачалоДня(Объект.ВходящаяДата));
	ОбновитьВторичныеДанныеОбъектаИЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область Пособие

&НаСервере
Процедура ОбновитьЭлементыГруппыПособие(Группа, Представление, Заполнена, Развернута, Видимость)
	Видимость = Объект.Загружен;
	Если Не Видимость Тогда
		Возврат;
	КонецЕсли;
	ЕстьДанныеЛН = ЗначениеЗаполнено(Объект.НомерЛН);
	ЕстьДанныеОтпуска = ЗначениеЗаполнено(Объект.ОтпускПоУходуДатаНачала);
	ЕстьДанныеРебенка = ЗначениеЗаполнено(Объект.РебенокДатаРождения) Или ЗначениеЗаполнено(Объект.РебенокДатаРождения);
	ЕстьНачалоПериода = ЗначениеЗаполнено(Объект.НачалоПериода);
	Заполнена = ЗначениеЗаполнено(Объект.ВходящийПервичныйДокумент) Или ЕстьДанныеЛН
		Или ЕстьДанныеОтпуска Или ЕстьДанныеРебенка Или ЕстьНачалоПериода;
	Если Развернута Тогда
		Элементы.НомерЛН.Видимость = РежимРедактирования Или ЕстьДанныеЛН;
		Элементы.ОтпускПоУходуГруппа.Видимость = РежимРедактирования Или ЕстьДанныеОтпуска;
		Элементы.РебенокГруппа.Видимость = РежимРедактирования Или ЕстьДанныеРебенка;
		Элементы.НачалоПериода.Видимость = РежимРедактирования Или ЕстьНачалоПериода;
		Элементы.Ребенок.Видимость = СЭДОФСС.ВидимостьПоляРодственник();
	Иначе
		Представления = Новый Массив;
		ЭлементСпискаВыбора = Элементы.КодВидаПособия.СписокВыбора.НайтиПоЗначению(Объект.КодВидаПособия);
		Если ЭлементСпискаВыбора = Неопределено Тогда
			Представления.Добавить(Объект.КодВидаПособия);
		Иначе
			Представления.Добавить(ЭлементСпискаВыбора.Представление);
		КонецЕсли;
		Если ЕстьДанныеЛН Тогда
			Представления.Добавить(СтрШаблон(НСтр("ru = 'ЛН %1'"), Объект.НомерЛН));
		КонецЕсли;
		Если ЕстьДанныеОтпуска Тогда
			Период = ОбщегоНазначенияБЗК.НаименованиеПериода(Объект.ОтпускПоУходуДатаНачала, Объект.ОтпускПоУходуДатаОкончания);
			Представления.Добавить(СтрШаблон(НСтр("ru = 'Отпуск по уходу %1'"), Период));
		КонецЕсли;
		Если ЕстьДанныеРебенка Тогда
			Представления.Добавить(НСтр("ru = 'Ребенок:'"));
			Если ЗначениеЗаполнено(Объект.Ребенок) Тогда
				Представления.Добавить(Объект.Ребенок);
			Иначе
				Если ЗначениеЗаполнено(Объект.РебенокСНИЛС) Тогда
					Представления.Добавить(СтрШаблон(НСтр("ru = 'СНИЛС %1'"), Объект.РебенокСНИЛС));
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.РебенокДатаРождения) Тогда
					Представления.Добавить(СтрШаблон(НСтр("ru = 'дата рождения %1'"), Формат(Объект.РебенокДатаРождения, "ДЛФ=D")));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ЕстьНачалоПериода Тогда
			Представления.Добавить(СтрШаблон(НСтр("ru = 'с %1'"), Формат(Объект.НачалоПериода, "ДЛФ=D")));
		КонецЕсли;
		Представление = СтрСоединить(Представления, " ");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область РанееОтправленныеСведения

&НаСервере
Процедура ОбновитьЭлементыГруппыРанееОтправленныеСведения(Группа, Представление, Заполнена, Развернута, Видимость)
	Видимость = Объект.Загружен;
	Если Не Видимость Тогда
		Возврат;
	КонецЕсли;
	ЕстьВходящийЗапрос = ЗначениеЗаполнено(Объект.ВходящийЗапрос) Или ЗначениеЗаполнено(Объект.НомерПроцесса);
	ЕстьВходящийОтветНаЗапрос = ЗначениеЗаполнено(Объект.ВходящийОтветНаЗапрос)
		Или ЗначениеЗаполнено(Объект.ИдентификаторСообщения101);
	ЕстьВходящийРеестр = ЗначениеЗаполнено(Объект.ВходящийНомерРеестра) Или ЗначениеЗаполнено(Объект.ВходящийРеестр)
		Или ЗначениеЗаполнено(Объект.ВходящееЗаявление);
	Заполнена = ЕстьВходящийЗапрос Или ЕстьВходящийОтветНаЗапрос Или ЕстьВходящийРеестр;
	Если Развернута Тогда
		Элементы.ГруппаВходящийЗапрос.Видимость = РежимРедактирования Или ЕстьВходящийЗапрос;
		Элементы.ГруппаВходящийОтветНаЗапрос.Видимость = РежимРедактирования Или ЕстьВходящийОтветНаЗапрос;
		Элементы.ГруппаВходящийРеестр.Видимость = РежимРедактирования Или ЕстьВходящийРеестр;
		Элементы.ВходящееЗаявление.Видимость = РежимРедактирования Или ЗначениеЗаполнено(Объект.ВходящееЗаявление)
			Или (ЕстьВходящийРеестр И Объект.КодВидаПособия <> "87" И Объект.КодВидаПособия <> "88");
	Иначе
		Представления = Новый Массив;
		Если ЕстьВходящийЗапрос Тогда
			Если ЗначениеЗаполнено(Объект.ВходящийЗапрос) Тогда
				Представления.Добавить(СокращенноеПредставление(Объект.ВходящийЗапрос, НСтр("ru = 'Входящий запрос'")));
			ИначеЕсли ЗначениеЗаполнено(Объект.НомерПроцесса) Тогда
				Представления.Добавить(СтрШаблон(НСтр("ru = 'процесс № %1'"), Объект.НомерПроцесса));
			КонецЕсли;
		КонецЕсли;
		Если ЕстьВходящийОтветНаЗапрос Тогда
			Если ЗначениеЗаполнено(Объект.ВходящийОтветНаЗапрос) Тогда
				Представления.Добавить(СокращенноеПредставление(Объект.ВходящийОтветНаЗапрос, НСтр("ru = 'Ответ на запрос'")));
			ИначеЕсли ЗначениеЗаполнено(Объект.ИдентификаторСообщения101) Тогда
				Представления.Добавить(СтрШаблон(НСтр("ru = 'Сообщение 101 %1'"), Объект.ИдентификаторСообщения101));
			КонецЕсли;
		КонецЕсли;
		Если ЕстьВходящийРеестр Тогда
			Если ЗначениеЗаполнено(Объект.ВходящийРеестр) Тогда
				Представления.Добавить(СокращенноеПредставление(Объект.ВходящийРеестр, НСтр("ru = 'Реестр'")));
			ИначеЕсли ЗначениеЗаполнено(Объект.ВходящийНомерРеестра) Тогда
				Представления.Добавить(СтрШаблон(НСтр("ru = 'Реестр %1'"), Объект.ВходящийНомерРеестра));
			КонецЕсли;
			Если ЗначениеЗаполнено(Объект.НомерСтрокиРеестра) Тогда
				Представления.Добавить(СтрШаблон(НСтр("ru = 'Строка %1'"), Объект.НомерСтрокиРеестра));
			КонецЕсли;
			Если ЗначениеЗаполнено(Объект.ВходящееЗаявление) Тогда
				Представления.Добавить(СокращенноеПредставление(Объект.ВходящийРеестр, НСтр("ru = 'Сведения для реестра'")));
			КонецЕсли;
		КонецЕсли;
		Представление = СтрСоединить(Представления, " ");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СокращенноеПредставление(Ссылка, СокращенныйСиноним)
	Представление = Строка(Ссылка);
	Возврат СтрЗаменить(Представление, Ссылка.Метаданные().Синоним, СокращенныйСиноним);
КонецФункции

&НаСервере
Процедура ВходящийЗапросПриИзмененииНаСервере()
	ЗафиксироватьИзменениеРеквизита("ВходящийЗапрос");
	ОбновитьВторичныеДанныеОбъектаИЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура ВходящийОтветНаЗапросПриИзмененииНаСервере()
	ЗафиксироватьИзменениеРеквизита("ВходящийОтветНаЗапрос");
	ОбновитьВторичныеДанныеОбъектаИЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура ВходящийРеестрПриИзмененииНаСервере()
	ЗафиксироватьИзменениеРеквизита("ВходящийРеестр");
	ОбновитьВторичныеДанныеОбъектаИЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура ВходящееЗаявлениеПриИзмененииНаСервере()
	ЗафиксироватьИзменениеРеквизита("ВходящееЗаявление");
	Объект.ВходящийПервичныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВходящееЗаявление, "ДокументОснование");
	ВходящийПервичныйДокументПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВходящийПервичныйДокументПриИзмененииНаСервере()
	ЗафиксироватьИзменениеРеквизита("ВходящийПервичныйДокумент");
	ОбновитьВторичныеДанныеОбъектаИЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область НедостающиеСведения

&НаСервере
Процедура ОбновитьЭлементыГруппыНедостающиеСведения(Группа, Представление, Заполнена, Развернута, Видимость)
	Видимость = Объект.Загружен;
	Если Не Видимость Тогда
		Возврат;
	КонецЕсли;
	Количество = Объект.НедостающиеСведения.Количество();
	Заполнена = Количество > 0;
	Если Развернута Тогда
		Элементы.НедостающиеСведенияКратко.Видимость = Ложь;
		Если Количество > 3 Тогда
			Элементы.НедостающиеСведения.ВысотаВСтрокахТаблицы = 0;
			Элементы.НедостающиеСведения.РастягиватьПоВертикали = Истина;
		Иначе
			Элементы.НедостающиеСведения.ВысотаВСтрокахТаблицы = Количество + 1;
			Элементы.НедостающиеСведения.РастягиватьПоВертикали = Ложь;
		КонецЕсли;
	Иначе
		Представление = Объект.НедостающиеСведенияКратко;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ТОФ

&НаСервере
Процедура ОбновитьЭлементыГруппыТОФ(Группа, Представление, Заполнена, Развернута, Видимость)
	Видимость = Объект.Загружен;
	Если Не Видимость Тогда
		Возврат;
	КонецЕсли;
	ЕстьКодНаименованиеТОФ = ЗначениеЗаполнено(Объект.КодТОФ) Или ЗначениеЗаполнено(Объект.НаименованиеТОФ);
	ЕстьОтветственныйСФР = ЗначениеЗаполнено(Объект.ОтветственныйСФРДолжность)
		Или ЗначениеЗаполнено(Объект.ОтветственныйСФРФИО) Или ЗначениеЗаполнено(Объект.ОтветственныйСФРТелефон);
	ЕстьПодписантСФР = ЗначениеЗаполнено(Объект.ПодписантСФРФИО) Или ЗначениеЗаполнено(Объект.ПодписантСФРДолжность);
	Заполнена = ЕстьКодНаименованиеТОФ Или ЕстьОтветственныйСФР Или ЕстьПодписантСФР;
	Если Развернута Тогда
		Элементы.КодНаименованиеТОФГруппа.Видимость = РежимРедактирования Или ЕстьКодНаименованиеТОФ;
		Элементы.ОтветственныйСФРГруппа.Видимость = РежимРедактирования Или ЕстьОтветственныйСФР;
		Элементы.ПодписантСФРГруппа.Видимость = РежимРедактирования Или ЕстьПодписантСФР;
	Иначе
		Представление = "";
		Если ЕстьКодНаименованиеТОФ Тогда
			Представление = СокрЛП(Объект.КодТОФ + " " + Объект.НаименованиеТОФ);
		КонецЕсли;
		Если ЕстьОтветственныйСФР Тогда
			Если Объект.ПодписантСФРФИО = Объект.ОтветственныйСФРФИО Тогда
				ЗаголовокФИО = НСтр("ru = 'Составлено и подписано:'");
			Иначе
				ЗаголовокФИО = НСтр("ru = 'Составлено:'");
			КонецЕсли;
			ДополнитьПредставление(Представление, ", ", ЗаголовокФИО);
			Если ЗначениеЗаполнено(Объект.ОтветственныйСФРДолжность) Тогда
				ДополнитьПредставление(Представление, " ", Объект.ОтветственныйСФРДолжность);
			КонецЕсли;
			Если ЗначениеЗаполнено(Объект.ОтветственныйСФРФИО) Тогда
				ДополнитьПредставление(Представление, " ", Объект.ОтветственныйСФРФИО);
			КонецЕсли;
			Если ЗначениеЗаполнено(Объект.ОтветственныйСФРТелефон) Тогда
				ДополнитьПредставление(Представление, ", ", СтрШаблон(НСтр("ru = 'Телефон: %1'"), Объект.ОтветственныйСФРТелефон));
			КонецЕсли;
		КонецЕсли;
		Если ЕстьПодписантСФР И Объект.ПодписантСФРФИО <> Объект.ОтветственныйСФРФИО Тогда
			ДополнитьПредставление(Представление, ", ", НСтр("ru = 'Подписано:'"));
			Если ЗначениеЗаполнено(Объект.ПодписантСФРДолжность) Тогда
				ДополнитьПредставление(Представление, " ", Объект.ПодписантСФРДолжность);
			КонецЕсли;
			Если ЗначениеЗаполнено(Объект.ПодписантСФРФИО) Тогда
				ДополнитьПредставление(Представление, " ", Объект.ПодписантСФРФИО);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область Свойства

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область ФиксацияВторичныхДанныхВДокументах

&НаСервере
Функция ОбъектЗафиксирован() Экспорт
	Возврат РеквизитФормыВЗначение("Объект").ОбъектЗафиксирован();
КонецФункции

&НаСервере
Процедура ОбновитьВторичныеДанныеНаСервере()
	Если ФиксацияВторичныхДанныхВДокументахКлиентСервер.ОбъектФормыЗафиксирован(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	ФиксацияЗаполнитьИдентификаторыФиксТЧ(ЭтотОбъект);
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ФиксацияВторичныхДанныхВДокументахКлиентСервер.СохранитьРеквизитыФормыФикс(ЭтотОбъект, ДокументОбъект);
	
	ПараметрыФиксации = ЭтотОбъект["ПараметрыФиксацииВторичныхДанных"];
	ДокументИзменен = ДокументОбъект.ОбновитьВторичныеДанные(ПараметрыФиксации);
	
	ТребуетсяЗаполнитьИсходящиеДокументы = Ложь;
	ИсходящиеДокументы = Документы.ЗапросРеквизитовДляВыплатыПособия.ИсходящиеДокументы(ДокументОбъект);
	
	Если ДокументИзменен Тогда
		Если ТолькоПросмотр Или Не ПравоДоступа("Изменение", ДокументОбъект.Метаданные()) Тогда
			ФиксацияВторичныхДанныхВДокументахФормы.ВывестиПредупреждениеОНаличииИзмененийВИсходныхДанныхКоторыеНельзяПрименить(
				ЭтотОбъект);
		Иначе
			Если Не ДокументОбъект.ЭтоНовый() Тогда
				ФиксацияВторичныхДанныхВДокументахФормы.УстановитьМодифицированность(ЭтотОбъект, Истина);
			КонецЕсли;
			ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
			ФиксацияЗаполнитьРеквизитыФормыФикс(Объект);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ФиксацияОписаниеФормы(ПараметрыФиксацииВторичныхДанных) Экспорт
	ОписаниеФормы = ФиксацияВторичныхДанныхВДокументахФормы.ОписаниеФормы();
	
	ОписаниеЭлементовФормы = Новый Соответствие();
	ОписаниеЭлементаФормы = ФиксацияВторичныхДанныхВДокументахФормы.ОписаниеЭлементаФормы();
	ОписаниеЭлементаФормы.ПрефиксПути = "Объект";
	Для Каждого КлючИЗначение Из ПараметрыФиксацииВторичныхДанных.ОписаниеФиксацииРеквизитов Цикл
		ОписаниеЭлементовФормы.Вставить(КлючИЗначение.Ключ, ОписаниеЭлементаФормы);
		Если Не РежимРедактирования И КлючИЗначение.Значение.ИмяГруппы = "ДанныеXML" Тогда
			Элемент = ЭлементСвязанныйСФиксируемымРеквизитом(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			Если Элемент <> Неопределено Тогда
				Элемент.ТолькоПросмотр = истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ОписаниеФормы.Вставить("ОписаниеЭлементовФормы", ОписаниеЭлементовФормы);
	
	ОписаниеФормы.Вставить("ФормаРедактируетсяПослеФиксации", Ложь);
	Возврат ОписаниеФормы;
КонецФункции

&НаСервере
Функция ЭлементСвязанныйСФиксируемымРеквизитом(Ключ, Значение)
	Элемент = Элементы.Найти(Ключ);
	Если Элемент = Неопределено Тогда
		Элемент = Элементы.Найти(Значение.ИмяРеквизита);
	КонецЕсли;
	Возврат Элемент;
КонецФункции

&НаСервере
Функция ФиксацияБыстрыйПоискРеквизитов()
	БыстрыйПоискРеквизитов = Новый Соответствие; // Ключ - имя элемента, значение - имя реквизита.
	
	ПараметрыФиксации = ЭтотОбъект["ПараметрыФиксацииВторичныхДанных"];
	Для Каждого КлючИЗначение Из ПараметрыФиксации.ОписаниеФиксацииРеквизитов Цикл
		Элемент = ЭлементСвязанныйСФиксируемымРеквизитом(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		Если Элемент <> Неопределено Тогда
			БыстрыйПоискРеквизитов.Вставить(Элемент.Имя, КлючИЗначение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат БыстрыйПоискРеквизитов;
КонецФункции

&НаСервере
Процедура ФиксацияЗаполнитьРеквизитыФормыФикс(ТекущийОбъект)
	ФиксацияВторичныхДанныхВДокументахФормы.ЗаполнитьРеквизитыФормыФикс(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ФиксацияЗаполнитьИдентификаторыФиксТЧ(Форма)
	ФиксацияВторичныхДанныхВДокументахКлиентСервер.ЗаполнитьИдентификаторыСтрок(Форма);
КонецПроцедуры

&НаСервере
Процедура ОтменитьВсеИсправленияНаСервере()
	ФиксацияВторичныхДанныхВДокументахКлиентСервер.ОчиститьФиксациюИзменений(ЭтотОбъект, Объект);
	ФиксацияЗаполнитьРеквизитыФормыФикс(Объект);
	ОбновитьВторичныеДанныеОбъектаИЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗафиксироватьИзменениеРеквизитаВФорме(Элемент, СтандартнаяОбработка = Ложь) Экспорт
	ОписаниеЭлементов = ФиксацияБыстрыйПоискРеквизитов();
	ФиксацияВторичныхДанныхВДокументахКлиентСервер.Подключаемый_ЗафиксироватьИзменениеРеквизитаВФорме(ЭтотОбъект, Элемент, ОписаниеЭлементов);
	ОбновитьВторичныеДанныеОбъектаИЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьИзменениеРеквизита(Имя)
	ОписаниеЭлементов = ФиксацияБыстрыйПоискРеквизитов();
	ФиксацияВторичныхДанныхВДокументахКлиентСервер.Подключаемый_ЗафиксироватьИзменениеРеквизитаВФорме(
		ЭтотОбъект,
		Элементы[Имя],
		ОписаниеЭлементов);
	ФиксацияВторичныхДанныхВДокументахКлиентСервер.СброситьФиксациюИзмененийРеквизитовПоОснованиюЗаполнения(
		ЭтотОбъект,
		Имя);
КонецПроцедуры

#КонецОбласти

#Область Поддержка

&НаСервере
Функция ПодготовитьВопросВПоддержку()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Вложения = Новый Массив;
	Возврат СЭДОФСС.ПодготовитьВопросВПоддержку(ДокументОбъект, Вложения);
КонецФункции

#КонецОбласти

#КонецОбласти
